#include <iostream>

int main()
{
	// --------------------------------------
	//  사칙 연산
	// --------------------------------------

	// 종류
	// +, -, *, /, %
	// 소괄호 계산을 제일 먼저하고
	// 곱하기 나누기 다음
	// 더하기 빼기를 합니다.

	// 곱하는 x 로 적는데요.
	// %는 무엇인가요?
	// %는 나누기 (나머지) 입니다.
	// /는 나누기 (몫)

	printf("2 + 3 = %d\n", 2 + 3);
	printf("(2 - 3) * 4 = %d\n", (2 - 3) * 4);
	printf("13 / 4 = %d\n", 13 / 4);
	printf("13 %% 4 = %d\n", 13 % 4);
	printf("13.0 / 4 = %f\n", 13.0 / 4);

	//**** 정수 나누기 정수는 정수 ****
	// 정수 나누기 실수는 실수
	// 실수 나누기 정수는 실수
	// 실수 나누기 실수는 실수


	// [실습]
	// 1. 두 정수의 합 구하는 프로그램 만들기
	// 2. 원의 반지름 (실수) 을 입력받고 원의둘레와 원의 넓이 구하는 프로그램 만들기
	//	원의 둘레 : 3.14 * 반지름 * 2
	//  원의 넓이 : 3.14 * 반지름 * 반지름
	// 3. 두 정수를 입력받아, 몫과 나머지를 출력해주는 프로그램 만들기
	// 4. 두 정수의 평균(실수)을 구하는 프로그램 만들기
	// 5. 두 정수를 입력받아(A, B) 두 값을 교환하기
	//   (A = 3, B = 5 로 입력받으면, A =5, B=3 이 되게끔)
	// 6. 세 정수를 입력받아, 총 합과 평균 구하는 프로그램 만들기

	// 문제 1번 
	{
	}

	// 문제 2번
	{
	}

}