#include <iostream>

int main()
{
	// 실습
	// 1. 정수를 하나 입력받고, 
	//    10~20 사이의 수인지 판단

	// 2. 정수를 하나 입력받고
	//	  홀수/짝수 판단

	// 3. 정수를 하나 입력받고
	//    3의 배수이면서 5의 배수인지 판별

	// 4. 키(실수)와 나이(정수)를 입력받고,
	//	  140cm 이상이고, 12세 이상이면, 놀이기구 탑승 가능
	//							아니면 탑승 불가능 문구출력

	// 5. 세 정수를 입력받고, 
	//		모두 다르면, 모두 다름
	//		둘만 같으면, 두개만 같음
	//		모두 같으면, 모두 같음 출력

	// 6. 점수 3개(정수)를 입력받고 평균이 80 이상이고, 
	//		모든 과목이 60점 이상이고, 다시한번 출석했나요?를 물어보고, 출석했으면 "합격"
	//																아니면	 "출결로 인한 불합격" 출력
	//						아니면	"점수 미달로 인한 불합격" 출력

	// 7. 1~7까지 입력받고 1:Monday, 2: Tuesday ~~ ... 7 : Sunday 출력
	
}