// 실행하는 방법 : Ctrl + F5
// 주석 : // (코멘트 적는칸) 메모 적기용.
// 
// #include <iostream>  => iostream 이라는 파일을 포함시키겠다.
// 다른 파일을 포함하겠다. 
// i => input (입력) (키보드)  (글자를 입력하는거)
// o => output (출력) (모니터) (글자를 출력하는거)
// stream => 조각

// iostream => 마이크로소프트
// stdlib, stdio 등등이 포함된 것이 iostream

#include <iostream>


// 본문
//  어떤 언어나 프로그램이 시작하면 main에서 시작이 됩니다.
//  [프로그램 시작점] 
// {  실행할 내용 }

// 수학을 잘하면 프로그래밍에 재능이 있다.
// 3년차까지는 그냥 많이 외운사람이 잘합니다. 
// 많이 쳐본사람이 잘합니다.

// 당장 취업할때까지의 상태에서는
// 많이 외운사람이 잘해요.
// 시간을 오래투자한 사람.

// 프로그래밍을 할때 가져야하는 자세
//  - 외우는거에 두려움이 없어야 한다.
//  - 일단 해봐야합니다.

int main()
{
    // printf("내용");  << 내용을 화면에 출력한다.  iostream
    // 프로그래밍 중요한 규칙 : 
    //  (괄호를 열면 항상 괄호를 닫아줘야한다.)
    //  (마지막에 ; 을 달아줘야한다) (모든 언어는 아님.)
    printf("Hello World!\n");

    //printf("Hello World!\n");
    // 한줄로 글을 적어야하는데, 줄띄움 문자(엔터) 를 적고싶을때, \n 가 줄띄움문자라고 해석하기로 약속함.
    // \n 

    printf("hello world\n가나다");

    // [실습]
    // 
    // 애국가 1절만 줄띄움 문자를 활용해서
    // 콘솔창에 출력해보기.
    // 실습50분까지하고 쉬는시간 10분 가질거에요.

    {
        // 중괄호가 두개면 탭 두개
        {
            // 중괄호가 세개면 탭 세개
        }
    }
}


// 프로그래밍 중요한 규칙 : 
// 1. 괄호를 열면 항상 닫아줘야합니다. (순서대로)
//   [], {}, (), "", ''
//   X: [ {  ] } 
//   O: [ {  } ],  [ ( { } ) ]
//   괄호를 적을때, 괄호를 열면 항상 바로 닫고 적어주세요.  [] => [123] , "" => "123"

// 2. 마지막에 항상 ; 붙여줍니다. (웬만한경우에)

// 3. 중괄호 1개당 탭 1개
//     그래야 이뻐보입니다.
//  좋은 프로그래밍 코드
//   - 가독성이 좋은 코드
//  가독성이 어떻게 해야 지켜지는가
//   - 많은 사람들이 봤을만한 코드가 

// 보기 - 솔루션탐색기

