#include <iostream>

int main()
{
	//본문

	// 단축키
	// 
	//  Ctrl + S => 저장 (수시로 눌러주세요.), 
	// (다른 IDE에서는 저장안한건 실행안할때가 있습니다.)
	//  Ctrl + A => 전체선택
	//  Alt + 드래그 => 부분 선택
	//  Ctrl + Z => 되돌리기
	//  Ctrl + Y => 앞으로 감기
	//  아무것도 선택안한상태로 + Ctrl + C, Ctrl + V => 라인복사
	//  Tab => 탭
	//  Shift + Tab => 탭 당기기
	//  F2 => 이름바꾸기
	//  Ctrl + X => 잘라내기
	//  Ctrl + 왼쪽방향키, 오른쪽방향키 => 단어 단위로 이동
	//  Ctrl + Shift + 왼쪽방향키, 오른쪽방향키 => 단어 단위로 이동 ( 선택영역으로 추가 )
	//  Home, End => 해당 라인 시작과 끝으로 이동
	// 
	//  Visual Studio 단축키
	// 
	//  Ctrl + K + F : 선택한 영역 코드 자동 정렬
	//  Ctrl + K,K : 책갈피 추가,제거 (코드위치 기억용) (파일이 1000개 이상되는 프로젝트에서 유용)
	//  Ctrl + K,W : 책갈피 열기
	//  
	// 
	// 실행 방법
	//  기본적인 실행 : Ctrl + F5
	//  디버깅 실행 : F5, (라인 왼쪽에 빨간점 찍고, F10으로 한줄씩 이동)
	// 
	// AI에 대해서

	printf("안녕하세요.");
	printf("123");
	printf("456");

}

// 단축키가 중요한 이유
//  많이 시도해본 사람
//  많이 시도해보려면, 많이 쳐야하는데
//  그 시간만큼 온전히 프로그래밍을 하는게 아님
//  집중할때 많이 쳐야해요.
//  단축키는 한번 손에 익으면 안까먹어요.


// AI에 대해서
//  - AI없는곳에서 프로그래밍 안할거다. (O)
//  - 인터넷으로 검색할때는 "내 생각을 기준"으로 검색
// 결국에는 코드 짜여지는게 "내 생각을 기준으로 된 코드"
// 
// 여러분들이 생각을 한 코드를 AI 한테 짜달라고 하는거까지는 괜찮아요.
// (내가 짤수있을때)




// 저 처음 프로그래밍을 배울때
//  인터넷에서 검색하면서 프로그래밍하지 말아라.
//   - 왜요? 저는 인터넷없는곳에서 프로그래밍 안할거라 괜찮아요.

// "내 생각을 기준으로 된 코드를 짜는 법"
//   << 수도코드

// 수도코드
//  프로그래밍을 하기 위해 C언어 를 배우는데,
//  언어는 "문법"이라는것이 확실하게 존재
//  문법에 구애받지않고
//  기능을 쭉 순서대로 적어둔것이 수도코드

// 해보면서 다시 설명

// 애국가

// C언어 
// printf("애국가 내용");

// 수도코드
// 출력 - 애국가내용 (여러분들의 생각의 단위)

// 가위바위보 게임을 만들어라.
// 
// [수도코드1]
// 내가 가위 바위 보 중에 하나낸다.
// 컴퓨터가 가위 바위 보 중에 하나낸다.
// 승패를 비교한다. 


// [수도코드2]
// 내가 가위 바위 보 중에 하나낸다.
// 컴퓨터가 가위 바위 보 중에 하나낸다.
// 내가 가위를 냈을때, 컴퓨터가 바위를 내면
//		내가 패배했다.
// 내가 바위를 냈을때, 컴퓨터가 보를 내면 
//		내가 패배했다.
// ... 중략


// 수도코드를 적는 훈련
//  << 배울때도 차이가 크고
//  << 신입일때 차이가 진짜 커요.

// 시니어가 일을 할당하면
//  일의 흐름을 파악못하고 먼저 코드를 짜는데
//  
// 먼저 아 이런순서로 해야겠다.

// 몬스터 A를 만드는데
//  이 몬스터는 플레이어를 보면 무조건 따라니는 몬스터를 만들어라.

// [수도코드를 안짜고 코드를짜면]
// 
// 기능하나하나 물어볼수있어요
// 
// 1. 몬스터입장에서 플레이어를 찾는다.
// 2. 타겟 플레이어가 있으면, 
//		몬스터는 플레이어 방향으로 회전한다.
//		몬스터는 플레이어 방향으로 이동한다.

// 3시부터는
//  여러분들 집에서 셋업하는 방법 설명드릴게요.

// Visual Studio 설치하는 방법

// 코드저장하는 방법
//  USB도 있고, 메일로 왔다갔다 할수도있지만

// 코드를 저장하는 사이트가 있습니다.
// 1. github.com 회원가입
// 2. github desktop 설치



